{"modelTopology": {"training_config": {"metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null, "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "epsilon": 1e-07, "lr": 0.0010000000474974513, "beta_2": 0.9990000128746033, "amsgrad": false, "decay": 0.0}}}, "backend": "tensorflow", "keras_version": "2.1.6", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Constant", "config": {"value": 0.1}}, "data_format": "channels_last", "batch_input_shape": [null, 1, 28, 28], "dilation_rate": [1, 1], "padding": "same", "filters": 32, "kernel_constraint": null, "kernel_size": [5, 5], "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.1, "mean": 0.0, "seed": null}}, "use_bias": true, "activation": "relu", "bias_constraint": null, "name": "conv2d_1", "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "trainable": true, "name": "max_pooling2d_1", "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Constant", "config": {"value": 0.1}}, "data_format": "channels_last", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "filters": 64, "kernel_size": [5, 5], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "strides": [1, 1], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.1, "mean": 0.0, "seed": null}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "name": "conv2d_2", "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "trainable": true, "name": "max_pooling2d_2", "strides": [1, 1]}}, {"class_name": "Flatten", "config": {"data_format": "channels_first", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Constant", "config": {"value": 0.1}}, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.1, "mean": 0.0, "seed": null}}, "use_bias": true, "activation": "relu", "bias_constraint": null, "name": "dense_1", "units": 1024}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "rate": 0.5, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Constant", "config": {"value": 0.1}}, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.1, "mean": 0.0, "seed": null}}, "use_bias": true, "activation": "softmax", "bias_constraint": null, "name": "dense_2", "units": 10}}]}}, "weightsManifest": [{"weights": [{"dtype": "float32", "name": "conv2d_1/kernel", "shape": [5, 5, 28, 32]}, {"dtype": "float32", "name": "conv2d_1/bias", "shape": [32]}, {"dtype": "float32", "name": "conv2d_2/kernel", "shape": [5, 5, 32, 64]}, {"dtype": "float32", "name": "conv2d_2/bias", "shape": [64]}, {"dtype": "float32", "name": "dense_1/kernel", "shape": [1792, 1024]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [1024]}, {"dtype": "float32", "name": "dense_2/kernel", "shape": [1024, 10]}, {"dtype": "float32", "name": "dense_2/bias", "shape": [10]}], "paths": ["group1-shard1of2", "group1-shard2of2"]}]}